{
  "categoryId": "firearms",
  "patents": [
    {
      "id": "US-10794647-B2",
      "title": "Bolt conversion apparatus for firearm and upper receiver for the same",
      "publicationDate": "2020-10-06",
      "imageCount": 15,
      "abstract": "A bolt conversion apparatus for a firearm and upper receiver for the same. The bolt conversion apparatus is removably attached to an upper receiver of a firearm and includes a receiver attachment portion and a bolt carrier portion. The receiver attachment portion is provided for attaching the bolt conversion apparatus to the upper receiver of the firearm.",
      "featured": true,
      "images": [
        "/images/patents/US-10794647-B2/fig1.jpg"
      ]
    },
    {
      "id": "US-10197356-B2",
      "title": "Extendable tang for a firearm",
      "publicationDate": "2019-02-05",
      "imageCount": 47,
      "abstract": "An extendable tang for a firearm that provides a more comfortable and stable grip for the user. The extendable tang includes mechanisms that allow it to be deployed when needed and retracted when not in use.",
      "featured": false,
      "images": [
        "/images/patents/US-10197356-B2/fig1.jpg"
      ]
    },
    {
      "id": "US-9453696-B2",
      "title": "Revolver louver",
      "publicationDate": "2016-09-27",
      "imageCount": 16,
      "abstract": "A revolver louver system that provides improved ventilation and cooling for firearms during operation. The system includes specialized louvers that direct air flow while maintaining structural integrity.",
      "featured": false,
      "images": [
        "/images/patents/US-9453696-B2/fig1.jpg"
      ]
    },
    {
      "id": "US-9228797-B2",
      "title": "Firearm handgrip with tool component",
      "publicationDate": "2016-01-05",
      "imageCount": 14,
      "abstract": "A firearm handgrip with an integrated tool component that allows users to perform maintenance and adjustments in the field without requiring separate tools.",
      "featured": false,
      "images": [
        "/images/patents/US-9228797-B2/fig1.jpg"
      ]
    },
    {
      "id": "US-8943728-B2",
      "title": "Fixed stock with integral storage",
      "publicationDate": "2015-02-03",
      "imageCount": 13,
      "abstract": "A fixed stock for a firearm that includes integrated storage compartments for ammunition, maintenance tools, and other accessories.",
      "featured": false,
      "images": [
        "/images/patents/US-8943728-B2/fig1.jpg"
      ]
    }
  ]
}