[
  {
    "name": "Lee Von Gunten",
    "position": "CEO, Watchdog Manufacturing",
    "image": "https://placehold.co/80x80",
    "content": "I am Lee Von Gunten, CEO of Watchdog manufacturing, where we produce and sell Home Security products such as our Watchdog Timers and others. I am pleased and proud to offer this short but sweet testimonial regarding Geoff Dobbin and his team at Dobbin IP Law P.C. This is a voluntary testimonial for Geoff and his company. Geoff did not ask for it.\n\nWe've been working with Geoff and staff for over 12 years with total confidence in the professionality and completeness of their services at fair costs through all of our patent and trademark work. Geoff has been there for us to help and answer questions and to advise us in all matters of Intellectual Law through several patent applications and trademark listings.\n\nGeoff and his staff are tops. I can't recommend them too highly."
  },
  {
    "name": "Matthew Prestwich",
    "position": "Ready Holster and Tactical Supply",
    "image": "https://placehold.co/80x80",
    "content": "I’ve known Geoff Dobbin and have used him as my patent attorney for over 7 years. During that time Geoff has filed multiple patents for me. Before meeting Geoff I consulted other patent attorneys and always came away frustrated that I could not get definite answers to my questions. It was refreshing when on my very first meeting with Geoff he gave me straight answers, explaining even the most complicated Intellectual Property issues in easy to understand language. Geoff has demonstrated utmost integrity while working on my patents and has an extensive knowledge of all aspects of Intellectual Property law. His work is of the highest quality and is delivered in a timely manner. I’m pleased to give Geoff my highest recommendation for your Intellectual Property work."
  },
  {
    "name": "Craig Charlton",
    "position": "Lock Jaw Ladder Grip",
    "image": "https://placehold.co/80x80",
    "content": "I have been working with Geoff Dobbin for approximately 8 years in relation to a range of patent, trademark and product licensing matters. I have found Geoff to be a knowledgeable and diligent intellectual property attorney who is also a pleasure to deal with. Geoff was able to provide practical and timely responses to questions I asked and was instrumental in finalizing patents and a trademark for my invention. I would not hesitate in recommending Geoff."
  },
  {
    "name": "Dr. Mark J. Hagmann",
    "position": "CTO, NewPath Research, LLC",
    "image": "https://placehold.co/80x80",
    "content": "Geoffrey Dobbin has been my patent attorney for the past six years and I am highly impressed by his ability to understand a wide range of complex technologies and describe them clearly, suggest appropriate strategies for intellectual property, and his adroitness in communicating with the USPTO."
  }
]
